data/Parm_PH_29/alpha_10/alpha_10_12000_4048/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00476795 -0.00010356 0.00000000 0.00006725 0.00000000 0.00342506)
(0.00456276 -0.00002077 0.00000000 0.00000815 0.00000000 0.00245020)
(-0.00045898 0.00000944 0.00000000 0.00002778 0.00000000 -0.00011570)
(0.00133671 -0.00006833 0.00000000 -0.00013350 0.00000000 0.00104048)
(0.00014314 -0.00011417 0.00000000 0.00008223 0.00000000 0.00018811)
(0.00014332 -0.00000295 0.00000000 -0.00011319 0.00000000 0.00005119)
(0.00010640 -0.00022903 0.00000000 0.00035788 0.00000000 0.00092327)
(0.00063767 -0.00041081 0.00000000 0.00024836 0.00000000 0.00095671)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
